04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/bubblePipe/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    phase           air1;

    cellZone        injection;

    massFlowRate    6e-7;
}

// ************************************************************************* //
