04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/bubblePipe/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (air1 air2 water);

air1
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         5;
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         7;
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{
    air1_water
    {
        type            constant;
        sigma           0.083;
    }

    air2_water
    {
        type            constant;
        sigma           0.083;
    }
}

bubbles
{
    continuousPhase water;

    sphericalDiameters
    {
        type            uniform;
        min             1e-3;
        max             12e-3;
    }

    shapeModel      spherical;

    coalescenceModel LehrMilliesMewes;

    breakupModel    LehrMilliesMewes;
}

// ************************************************************************* //
